#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    string a[10]= {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    string b[10]= {"десять","одиннадцaть","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"};
    string c[10]= {"двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string d[10]= {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    int x;
    cout<<"введите число: ";
    cin >> x;
    int y=x/100; int z=x%100/10; int u=x%10; int w=x%100;
    if (x/1000 < 1 and x/1000 > 0,1){
	    cout << d[y-1] << " ";
    }
	if (w>10 and w<=19){
		cout << b[w-10] << " ";
		return 0;
	}
	
    else if (z==1) cout << b[0] << " ";
    else if (z>=2 and z<=9) cout << c[z-2] << " ";
    
    cout << a[u];
    return 0;
}