#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    int date, month;
    string a[31] ={"первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвертое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"};
    string b[12] ={"января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
    cout<<"число: "; cin>>date;
    cout<<"месяц: "; cin>>month;
    cout<<a[date-1]<<" "<<b[month-1];
    return 0;
}